{

    "Header.Item1": "À propos de moi",
    "Header.Item2": "Expérience",
    "Header.Item3": "Projets",
    "Header.Item4": "Contact",
    "Header.cvBtn": "CV",
    "Header.cvName": "CV.pdf",

    "Banner.Pretitle": "Bonjour je suis",
    "Banner.Description": ["Je suis un développeur Java full stack compétent et enthousiaste, maîtrisant Java et Angular.",
    "J'ai une solide expérience dans le développement d'applications web robustes et évolutives.",
    "Je suis un collaborateur efficace passionné par la création d'applications de haute qualité."],
    "Banner.ActionBtn": "Prendre contact",

    "AboutMe.Title": "À propos de moi",
    "AboutMe.Paragraphs": [
      "Je suis un développeur Full Stack Java enthousiaste et compétent, maîtrisant à la fois Java ainsi que le framework Angular.",
      "J'ai acquis une solide expérience dans le développement d'applications web robustes et évolutives en utilisant ces technologies.",
      "Je suis capable de collaborer efficacement avec des équipes multidisciplinaires pour fournir des solutions logicielles de haute qualité.",
      "J'ai une compréhension approfondie des principes et des meilleures pratiques en développement logiciel, et je suis passionné par la création d'applications efficaces et conviviales pour les utilisateurs.",
      "Je reste constamment à jour sur les dernières avancées technologiques et je m'engage à améliorer continuellement mes compétences pour favoriser l'innovation et atteindre les objectifs des projets.",
      "Je possède d'excellentes capacités de résolution de problèmes et j'aborde le développement logiciel avec minutie."
  ],


    "Experience.Title": "Expérience",
    "Experience.Jobs": [
      {
            "Tab": "Leyton",
            "Title": "Fullstack developer <Angular,Spring Boot> ",
            "Subject":"La mise en place d’une platforme de scoring des contreparties pour le trading des quotas carbones",
            "Date": "Février.2023 – Août.2023 ",
            "Description": [
              "Développement des APIs REST avec Spring Boot.",
              "Conception et développement de l'interface utilisateur.",
              "Intégrer notre application dans le serveur Keycloak.",
              "Création des tests unitaire en utilisant JUnit et Mockito.",
              "Auditer les entités en utilisant Hibernate Envers.",
              "La collaboration avec l’équipe en utilisant la méthologie agile de la méthode scrum."
            ]
      },
      {
        "Tab": "E-ambition",
        "Title": "Fullstack developer <Angular,Spring Boot> ",
        "Subject":"La création d'une application web pour la gestion des projets",
        "Date": "Juil.2022 – Sept.2022",
        "Description": [
          "Création d'un système d'authentification pour les utilisateurs de l'application de gestion de projets en utilisant JSON Web Tokens (JWT).",
          "Développement des interfaces utilisateur pour la connexion, l'inscription et la gestion des profils utilisateurs avec Angular.",
          "Développement des APIs REST avec Spring Boot.",
          "Conception et développement de l'interface utilisateur avec Angular.",
          "La collaboration avec l’équipe en utilisant la méthode scrum."
        ]
      }
    ],

    "FeatureProjects.Title": "Projets",
    "FeatureProjects.Label": "Projet Vedette",
    "FeatureProjects.Projects": [
      {
          "Title": "Siteweb eCommerce",
          "Description": "Site eCommerce offrant une navigation facile et un filtrage efficace des produits par catégorie. Les utilisateurs peuvent ajouter facilement les produits désirés à leur panier, en personnalisant les quantités en quelques clics seulement.",
          "imgs": [
              "assets/images/ecommerceProj/ecommerce.jpeg"
          ],
          "ghLink": "https://github.com/monaimJA/eCommerceProject",
          "demoLink": "https://monaimja.github.io/eCommerceProject/",
          "Technologies": ["Angular", "fakeapi", "Bootstrap"]
      },
      {
          "Title": "QR Code Scanner",
          "Description": "Scanner ou lecteur de code en HTML, CSS et JavaScript. Dans cette application, les utilisateurs peuvent télécharger n'importe quelle image de code QR et décoder/extraire son contenu. ",
          "imgs": [
              "assets/images/QrCodeProject/QRCode.jpeg"
          ],
          "ghLink": "https://github.com/monaimJA/QRCodeScanner",
          "demoLink": "https://monaimja.github.io/QRCodeScanner/",
          "Technologies": ["HTML", "CSS", "Javascript"]
      },
      {
          "Title": "Food Mine",
          "Description": "Conçu et développé un site web dynamique axé sur l'alimentation, enrichi de fonctionnalités essentielles telles qu'un panier d'achat convivial pour des achats sans tracas. Intégré une fonctionnalité de recherche robuste pour une navigation facile et un accès rapide aux articles alimentaires désirés. Mis en place un système de notation unique permettant aux utilisateurs d'exprimer leurs préférences en aimant ou en n'aimant pas différents types d'aliments, améliorant ainsi l'expérience de navigation personnalisée.",
          "imgs": ["assets/images/mineFood/foodMine.jpeg"],
          "ghLink": "https://github.com/monaimJA/mineFood_website",
          "demoLink": "https://monaimja.github.io/mineFood_website/",
          "Technologies": ["Angular"]
      },
      {
          "Title": "Chat Now Application",
          "Description": "Application permettant de créer des salons de discussion pour diffuser des messages à tous les utilisateurs, ainsi que d'envoyer des messages privés individuels à un utilisateur spécifique.",
          "imgs": ["assets/images/chatNow/chatnow.jpeg"],
          "ghLink": "https://github.com/monaimJA/ChatNowApp",
          "demoLink": "https://github.com/monaimJA/ChatNowApp",
          "Technologies": ["React", "Spring boot", "WebSocket"]
      }
  ],



    "OtherProjects.Title": "Mas proyectos",
    "OtherProjects.Projects": [{
            "Title": "Pokemon",
            "Description": "Buscador de pokemons que utiliza la pokeapi. Se usó programación orientada a objetos para organizar la información de los pokemons junto con su respectiva imagen.",
            "ghLink": "https://github.com/andresjosehr/pokemon-angular",
            "demoLink": "https://proyectos.andresjosehr.com/pokemon-list",
            "Technologies": ["Angular", "RxJs", "API", "Bootstrap"]
        },
        {
            "Title": "Coming soon page",
            "Description": "Proyecto personal de una página dividida de dos columnas para ser usado como 'Coming soon page'. Programada para ser totalmente responsive design. Cuenta con un campo de formulario para suscribirse por correo electrónico.",
            "ghLink": "https://github.com/andresjosehr/coming-soon-page",
            "demoLink": "https://proyectos.andresjosehr.com/coming-soon-page",
            "Technologies": ["Angular", "SASS", "CSS GRID", "Reactive form"]
        },
        {
            "Title": "Four card feature section",
            "Description": "Una sola página que cuenta con un diseño minimalista que enumera 4 características en 4 cards. Se usan animaciones de entrada con angular animations.",
            "ghLink": "https://github.com/andresjosehr/fourd-card-feature-section",
            "demoLink": "https://proyectos.andresjosehr.com/four-card-feature-section",
            "Technologies": ["Angular", "SASS", "CSS GRID"]
        },
        {
            "Title": "Social proof section",
            "Description": "Proyecto personal de una página diseñada a partir de un diseño hecho en figma. Se utilizó angular para el desarrollo junto con SASS y CSS GRID.",
            "ghLink": "https://github.com/andresjosehr/social-proof-section",
            "demoLink": "https://proyectos.andresjosehr.com/social-proof-section",
            "Technologies": ["Angular", "CSS GRID", "GIT"]
        },
        {
            "Title": "FAQ accordion card",
            "Description": "Acordeón de preguntas frecuentes con lógica y animnaciones realizadas en Angular.",
            "ghLink": "https://github.com/andresjosehr/faq-accordion",
            "demoLink": "https://proyectos.andresjosehr.com/faq-accordion",
            "Technologies": ["Angular", "CSS GRID", "Angular animations"]
        },
        {
            "Title": "Profile card",
            "Description": "Simple diseño de una página que cuenta con una carta de perfil con información básica de una persona.",
            "ghLink": "https://github.com/andresjosehr/profile-card-component",
            "demoLink": "https://proyectos.andresjosehr.com/profile-card-component",
            "Technologies": ["Angular", "SASS", "GIT"]
        }
    ],

    "Contact.Pretitle": "Quoi de neuf?",
    "Contact.Title": "Prendre contact!",
    "Contact.Content": "Je serai ravi de recevoir votre contact si vous souhaitez discuter de nouvelles opportunités. Écrivez-moi et je vous répondrai dès que je verrai votre message.",
    "Contact.Btn": "Contactez-moi"


}
